const questions = [
  {
    id: 1,
    question: "అసలు వ్యాసుడు ఎవరి కుమారుడు?",
    options: [
      "పరాశర మహర్షి & సత్యవతి దేవి",
      "శంతనుడు & గంగా దేవి",
      "వశిష్ఠ మహర్షి & అరుంధతి",
      "జమదగ్ని & రేణుక"
    ],
    answer: "పరాశర మహర్షి & సత్యవతి దేవి"
  },

  {
    id: 2,
    question: "విదురుడు ఎలా జన్మించాడు?",
    options: [
      "అంభికకు జన్మించాడు",
      "అంభాలికకు జన్మించాడు",
      "వ్యాసుడు మరియు దాసి ద్వారా జన్మించాడు",
      "కుంతీదేవికి జన్మించాడు"
    ],
    answer: "వ్యాసుడు మరియు దాసి ద్వారా జన్మించాడు"
  },

  {
    id: 3,
    question: "వైష్ణవాస్త్రాన్ని ఎవరు ప్రయోగించారు?",
    options: [
      "కర్ణుడు",
      "అశ్వత్థామ",
      "భగదత్తుడు",
      "దుర్యోధనుడు"
    ],
    answer: "భగదత్తుడు"
  },

  {
    id: 4,
    question: "ఈ ఆస్త్రాన్ని ఇచ్చిన వారు తప్పించి ఎవరూ అడ్డుకోలేరు. ఆ ఆస్త్రం పేరు ఏమిటి?",
    options: [
      "బ్రహ్మాస్త్రం",
      "నారాయణాస్త్రం",
      "వైష్ణవాస్త్రం",
      "పాశుపతాస్త్రం"
    ],
    answer: "పాశుపతాస్త్రం"
  },

  {
    id: 5,
    question: "“కర్మణ్యేవాధికారస్తే మా ఫలేషు కదాచన” అనే శ్లోకానికి అర్థం ఏమిటి?",
    options: [
      "ఫలితాన్ని మాత్రమే ఆశించాలి",
      "నీ పని చేయి, ఫలితాన్ని ఆశించకు",
      "పని చేయకుండా భగవంతుని ప్రార్థించాలి",
      "ఫలితం కోసం మాత్రమే కష్టపడాలి"
    ],
    answer: "నీ పని చేయి, ఫలితాన్ని ఆశించకు"
  },
  {
  id: 6,
  question: "అర్జునుడు, శ్రీకృష్ణుడు కురుక్షేత్రంలో ఉపయోగించిన శంఖాల పేర్లు ఏమిటి?",
  options: [
    "దేవదత్తం & పాంచజన్యం",
    "అనంతవిజయం & పాంచజన్యం",
    "సుఘోషం & మణిపుష్పకం",
    "పౌండ్రం & దేవదత్తం"
  ],
  answer: "దేవదత్తం & పాంచజన్యం"
},

{
  id: 7,
  question: "కురుక్షేత్ర యుద్ధం మొదటి రోజున కౌరవులకు నాయకుడు ఎవరు? పాండవులకు నాయకుడు ఎవరు?",
  options: [
    "ద్రోణుడు & అర్జునుడు",
    "భీష్ముడు & దృష్టద్యుమ్నుడు",
    "కర్ణుడు & భీముడు",
    "శల్యుడు & యుధిష్ఠిరుడు"
  ],
  answer: "భీష్ముడు & దృష్టద్యుమ్నుడు"
},

{
  id: 8,
  question: "నరుడు ఎవరు? నారాయణుడు ఎవరు?",
  options: [
    "భీముడు & కృష్ణుడు",
    "అర్జునుడు & కృష్ణుడు",
    "యుధిష్ఠిరుడు & విష్ణువు",
    "నకులుడు & కృష్ణుడు"
  ],
  answer: "అర్జునుడు & కృష్ణుడు"
},

{
  id: 9,
  question: "పరాశక్తి ప్రేమకు బాధ్యుడైనవాడు, పామును హారంగా ధరించినవాడు, పాశుపతాస్త్రాన్ని వరంగా ఇవ్వగలిగినవాడి దగ్గర విద్య నేర్చుకున్నవాడి శిష్యుడు ఎవరు?",
  options: [
    "ద్రోణాచార్యుడు",
    "భీష్ముడు",
    "పరశురాముడు",
    "కర్ణుడు"
  ],
  answer: "పరశురాముడు"
},

{
  id: 10,
  question: "కురుక్షేత్ర యుద్ధంలో శ్రీకృష్ణుడు కూడా ఎదురుకోలేని ఆస్త్రం ఒకటి ప్రయోగించబడింది. ఆ ఆస్త్రాన్ని ఎవరు ప్రయోగించారు? ఆ ఆస్త్రం పేరు ఏమిటి?",
  options: [
    "కర్ణుడు – వాసవి శక్తి",
    "భగదత్తుడు – వైష్ణవాస్త్రం",
    "అశ్వత్థామ – నారాయణాస్త్రం",
    "ద్రోణుడు – బ్రహ్మాస్త్రం"
  ],
  answer: "కర్ణుడు – వాసవి శక్తి"
},
{
  id: 11,
  question: "ఒక పురుగు వలన వచ్చిన శాపం ఏమిటి? ఆ పురుగును ఎవరు పంపించారు?",
  options: [
    "విద్య అంతా మర్చిపోతావు – ఇంద్రుడు",
    "విద్య అంతా మర్చిపోతావు – దేవేంద్రుడు",
    "విద్య అంతా మర్చిపోతావు – భూమిదేవి",
    "విద్య అంతా మర్చిపోతావు – పరశురాముడు"
  ],
  answer: "విద్య అంతా మర్చిపోతావు – ఇంద్రుడు"
},

{
  id: 12,
  question: "ద్రోణాచార్యుడి భార్య పేరు ఏమిటి?",
  options: [
    "కుంతి",
    "కృపి",
    "గాంధారి",
    "సుభద్ర"
  ],
  answer: "కృపి"
},

{
  id: 13,
  question: "కర్ణుడికి వచ్చిన రెండు శాపాలు ఏమిటి?",
  options: [
    "విద్య అంతా మర్చిపోతావు – రథం భూమిలో ఇరుక్కుపోతుంది",
    "అస్త్రాలు పనిచేయవు – రథం విరిగిపోతుంది",
    "కవచ కుండలాలు పోతాయి – రథం కాలిపోతుంది",
    "యుద్ధంలో ఓడిపోతావు – గుర్రాలు చనిపోతాయి"
  ],
  answer: "విద్య అంతా మర్చిపోతావు – రథం భూమిలో ఇరుక్కుపోతుంది"
},

{
  id: 14,
  question: "భీముడికి విషం పెట్టిన తరువాత అతనిని ఎవరు కాపాడారు?",
  options: [
    "గంధర్వులు",
    "నాగలోకవాసులు",
    "దేవతలు",
    "యక్షులు"
  ],
  answer: "నాగలోకవాసులు"
},

{
  id: 15,
  question: "ఒక కాలంలో అర్జునుడిని రథసారథిగా పెట్టుకున్న వ్యక్తి, యుద్ధం మొదటి రోజునే మరణించాడు. అతను ఎవరు?",
  options: [
    "ఉత్తరుడు",
    "అభిమన్యుడు",
    "శ్వేతుడు",
    "దృష్టద్యుమ్నుడు"
  ],
  answer: "ఉత్తరుడు"
},

{
  id: 16,
  question: "“ఎవడైతే నా కొడుకును బాణాలతో కొట్టాడో, అతడు తన కొడుకు చేతిలోనే మరణించుగాక” అని ఈ మాట అన్నది ఎవరు?",
  options: [
    "గంగా దేవి",
    "కుంతి దేవి",
    "సత్యవతి దేవి",
    "గాంధారి"
  ],
  answer: "గంగా దేవి"
},
{
  id: 17,
  question: "హస్తినాపురంలోని రంగభూమిలో కర్ణుడిని చూసినప్పుడు కుంతీదేవి ఏ నిజాన్ని గుర్తించింది?",
  options: [
    "అతడు అర్జునుడి స్నేహితుడు",
    "అతడే తన కుమారుడు",
    "అతడు ద్రోణాచార్యుని శిష్యుడు",
    "అతడు సూర్యదేవుని దూత"
  ],
  answer: "అతడే తన కుమారుడు"
},

{
  id: 18,
  question: "కర్ణుడు ఏ రాజ్యానికి రాజు?",
  options: [
    "మగధ",
    "అంగదేశం",
    "పాంచాలం",
    "హస్తినాపురం"
  ],
  answer: "అంగదేశం"
},

{
  id: 19,
  question: "‘నువ్వెవరురా?’ అని ద్రోణాచార్యుడిని అవమానించినవాడు ఎవరు?",
  options: [
    "దుర్యోధనుడు",
    "భీష్ముడు",
    "ద్రుపదుడు",
    "శకుని"
  ],
  answer: "ద్రుపదుడు"
},

{
  id: 20,
  question: "పాండవులు గురుదక్షిణగా ద్రోణాచార్యునికి ఏమి సమర్పించారు?",
  options: [
    "అంగదేశాన్ని",
    "ద్రుపదుడిని బంధించి",
    "కర్ణుడిని ఓడించి",
    "శకునిని బంధించి"
  ],
  answer: "ద్రుపదుడిని బంధించి"
},

{
  id: 21,
  question: "శ్రీమహావిష్ణువు ద్వారపాలకుల పేర్లు ఏమిటి?",
  options: [
    "జయుడు, విజయుడు",
    "నందుడు, సునందుడు",
    "చండుడు, ప్రచండుడు",
    "గరుడుడు, ఆదిశేషుడు"
  ],
  answer: "జయుడు, విజయుడు"
},

{
  id: 22,
  question: "సత్యయుగంలో జయవిజయులు ఎవరిగా జన్మించారు?",
  options: [
    "రావణుడు, కుంభకర్ణుడు",
    "శిశుపాలుడు, దంతవక్రుడు",
    "హిరణ్యాక్షుడు, హిరణ్యకశిపుడు",
    "కంసుడు, జరాసంధుడు"
  ],
  answer: "హిరణ్యాక్షుడు, హిరణ్యకశిపుడు"
},

{
  id: 23,
  question: "భీముడిని నేలపై బలవంతంగా నెట్టేలా చేసిన ఆస్త్రం ఏది?",
  options: [
    "వైష్ణవాస్త్రం",
    "బ్రహ్మాస్త్రం",
    "నారాయణాస్త్రం",
    "పాశుపతాస్త్రం"
  ],
  answer: "నారాయణాస్త్రం"
},

{
  id: 24,
  question: "అంబ పునర్జన్మలో ఎవరిగా జన్మించింది?",
  options: [
    "ఉలూపి",
    "చిత్రాంగద",
    "శిఖండి",
    "సుభద్ర"
  ],
  answer: "శిఖండి"
},
{
  id: 25,
  question: "భక్తికి బానిసైన వాడు, వేగంలో గరుత్మంతుడుని మించిన వాడు, రూపంలో దిగంబరుడు — అయితే ఇతని సోదరుడు ఎవరు?",
  options: [
    "అర్జునుడు",
    "భీముడు",
    "నకులుడు",
    "సహదేవుడు"
  ],
  answer: "భీముడు"
},
{
  id: 26,
  question: "గతం, వర్తమానం, భవిష్యత్తు తెలుసుకునే శక్తి ఎవరికుంది?",
  options: [
    "నకులుడు",
    "సహదేవుడు",
    "అర్జునుడు",
    "యుధిష్ఠిరుడు"
  ],
  answer: "సహదేవుడు"
},

{
  id: 27,
  question: "కర్ణుడి చిన్ననాటి పేరు / అసలు పేరు ఏమిటి?",
  options: [
    "రాధేయుడు",
    "వైకర్తనుడు",
    "వసుసేనుడు",
    "అంగరాజు"
  ],
  answer: "వసుసేనుడు"
},

{
  id: 28,
  question: "కురుక్షేత్ర యుద్ధంలో పాల్గొన్న చిరంజీవులలో ఒకరు ఎవరు?",
  options: [
    "భీష్ముడు",
    "అశ్వత్థామ",
    "ద్రోణాచార్యుడు",
    "దుర్యోధనుడు"
  ],
  answer: "అశ్వత్థామ"
},

{
  id: 29,
  question: "ఎనిమిది చిరంజీవులలో ఎవరు లేరు?",
  options: [
    "విభీషణుడు",
    "మహాబలి",
    "వేదవ్యాసుడు",
    "భీముడు"
  ],
  answer: "భీముడు"
},

{
  id: 30,
  question: "సహదేవుడి శంఖం పేరు ఏమిటి?",
  options: [
    "దేవదత్తం",
    "పాంచజన్యం",
    "అనంతవిజయం",
    "మణిపుష్పకము"
  ],
  answer: "మణిపుష్పకము"
},
{
  id: 31,
  question: "‘మీ అమ్మ ఎవరు? మీ నాన్న ఎవరు? తెలియదు’ అని చెప్పబడిన ఈ వర్ణనలో సూచించబడినవాడు ఎవరు?",
  options: [
    "శ్రీమహావిష్ణువు",
    "బ్రహ్మదేవుడు",
    "పరమశివుడు",
    "ఇంద్రుడు"
  ],
  answer: "పరమశివుడు"
},

{
  id: 32,
  question: "సముద్రమథనంలో హాలాహల విషాన్ని తాగి నీలకంఠుడిగా ప్రసిద్ధి చెందినవాడు ఎవరు?",
  options: [
    "శ్రీమహావిష్ణువు",
    "పరమశివుడు",
    "బ్రహ్మదేవుడు",
    "అగ్నిదేవుడు"
  ],
  answer: "పరమశివుడు"
},

{
  id: 33,
  question: "దుర్యోధనుడు పాండవులను కాల్చి చంపడానికి కట్టించిన గృహం పేరు ఏమిటి?",
  options: [
    "మాయాసభ",
    "ఇంద్రప్రస్థం",
    "లాక్షాగృహం",
    "హస్తినాపురం"
  ],
  answer: "లాక్షాగృహం"
},

{
  id: 34,
  question: "పాండవులను చంపే కుట్ర గురించి వారికి ముందుగా చెప్పినవాడు ఎవరు?",
  options: [
    "భీష్ముడు",
    "ద్రోణాచార్యుడు",
    "విదురుడు",
    "కృపాచార్యుడు"
  ],
  answer: "విదురుడు"
},

{
  id: 35,
  question: "లాక్షాగృహం కుట్ర తెలిసిన తరువాత పాండవులు ఎలా తప్పించుకున్నారు?",
  options: [
    "యుద్ధం చేసి బయటపడ్డారు",
    "కృష్ణుడి సహాయంతో పారిపోయారు",
    "సొరంగ మార్గం ద్వారా బయటపడ్డారు",
    "భీష్ముడు కాపాడాడు"
  ],
  answer: "సొరంగ మార్గం ద్వారా బయటపడ్డారు"
},

{
  id: 36,
  question: "వైష్ణవాస్త్రాన్ని ప్రయోగించినవాడు ఎవరు?",
  options: [
    "కర్ణుడు",
    "అశ్వత్థామ",
    "భగదత్తుడు",
    "దుర్యోధనుడు"
  ],
  answer: "భగదత్తుడు"
},

{
  id: 37,
  question: "పాండవులు మరియు కౌరవులు ఏ వంశంలో జన్మించారు?",
  options: [
    "సూర్యవంశం",
    "అగ్నివంశం",
    "చంద్రవంశం",
    "యదువంశం"
  ],
  answer: "చంద్రవంశం"
},
{
  id: 38,
  question: "హిడింబుడిని చంపిన తరువాత అతని సోదరి హిడింబిని వివాహం చేసుకున్నవాడు ఎవరు?",
  options: [
    "అర్జునుడు",
    "భీముడు",
    "నకులుడు",
    "సహదేవుడు"
  ],
  answer: "భీముడు"
},

{
  id: 39,
  question: "భీముడు మరియు హిడింబికి పుట్టిన కుమారుడు ఎవరు?",
  options: [
    "అభిమన్యుడు",
    "ఇరవాన్",
    "ఘటోత్కచుడు",
    "బభ్రువాహనుడు"
  ],
  answer: "ఘటోత్కచుడు"
},

{
  id: 40,
  question: "రోజుకు ఒక మనిషిని, భోజనంతో పాటు పంపించాలనే నియమం పెట్టిన రాక్షసుడు ఎవరు? అతనిని ఎవరు సంహరించారు?",
  options: [
    "హిడింబుడు – అర్జునుడు",
    "బకాసురుడు – భీముడు",
    "కీచకుడు – భీముడు",
    "జటాసురుడు – సహదేవుడు"
  ],
  answer: "బకాసురుడు – భీముడు"
},

{
  id: 41,
  question: "లాక్షాగృహం నుండి తప్పించుకున్న తరువాత పాండవులు అజ్ఞాతవాసం చేయాలని ఎందుకు నిర్ణయించుకున్నారు?",
  options: [
    "రాజ్యాన్ని వదిలి యాత్రలకు వెళ్లడానికి",
    "కౌరవుల నుండి ప్రాణాపాయం ఉండటం వల్ల మరియు సరైన సమయం వచ్చే వరకు శక్తి, మిత్రబలం పెంచుకోవడానికి",
    "ద్రోణాచార్యుని ఆజ్ఞ వల్ల",
    "కృష్ణుని ఆజ్ఞ వల్ల"
  ],
  answer: "కౌరవుల నుండి ప్రాణాపాయం ఉండటం వల్ల మరియు సరైన సమయం వచ్చే వరకు శక్తి, మిత్రబలం పెంచుకోవడానికి"
},

{
  id: 42,
  question: "కురుక్షేత్ర యుద్ధంలో ఒకే రోజులో అనేక మహావీరులను ఎదుర్కొని వారిలో వణుకు పుట్టించిన ఇద్దరు వీరులు ఎవరు?",
  options: [
    "అర్జునుడు – భీముడు",
    "నకులుడు – సహదేవుడు",
    "అభిమన్యుడు – ఘటోత్కచుడు",
    "యుధిష్ఠిరుడు – సాత్యకి"
  ],
  answer: "అభిమన్యుడు – ఘటోత్కచుడు"
},
{
  id: 43,
  question: "జూదంలో ఓడిపోయిన పాండవులకు కౌరవులు విధించిన శిక్ష ఏమిటి?",
  options: [
    "10 సంవత్సరాలు అరణ్యవాసం",
    "12 సంవత్సరాలు అరణ్యవాసం మరియు 1 సంవత్సరం అజ్ఞాతవాసం",
    "14 సంవత్సరాలు అరణ్యవాసం",
    "రాజ్యం విడిచిపెట్టడం"
  ],
  answer: "12 సంవత్సరాలు అరణ్యవాసం మరియు 1 సంవత్సరం అజ్ఞాతవాసం"
},

{
  id: 44,
  question: "అర్జునుడికి ఇంద్రలోకంలో శాపం ఇచ్చినది ఎవరు?",
  options: [
    "మెనక",
    "రంభ",
    "ఊర్వశి",
    "తిలోత్తమ"
  ],
  answer: "ఊర్వశి"
},

{
  id: 45,
  question: "అరణ్యవాస సమయంలో పాండవుల కుటీరానికి వచ్చిన మహర్షి ఎవరు?",
  options: [
    "వశిష్ఠ మహర్షి",
    "విశ్వామిత్ర మహర్షి",
    "దుర్వాస మహర్షి",
    "నారద మహర్షి"
  ],
  answer: "దుర్వాస మహర్షి"
},

{
  id: 46,
  question: "అజ్ఞాతవాసంలో పాండవులు తమ ఆయుధాలను ఎక్కడ దాచారు?",
  options: [
    "అశ్వత్థ వృక్షం",
    "వటవృక్షం",
    "శమీ వృక్షం (జమ్మి చెట్టు)",
    "మామిడి చెట్టు"
  ],
  answer: "శమీ వృక్షం (జమ్మి చెట్టు)"
},

{
  id: 47,
  question: "అర్జునుడు మరియు చిత్రాంగదలకు పుట్టిన కుమారుడు ఎవరు?",
  options: [
    "అభిమన్యుడు",
    "ఇరవాన్",
    "ఘటోత్కచుడు",
    "బభ్రువాహనుడు"
  ],
  answer: "బభ్రువాహనుడు"
},

{
  id: 48,
  question: "పాండవులు అజ్ఞాతవాసం చేసిన రాజ్యం పేరు ఏమిటి?",
  options: [
    "అంగదేశం",
    "పాంచాల రాజ్యం",
    "విరాట రాజ్యం (మత్స్య దేశం)",
    "హస్తినాపురం"
  ],
  answer: "విరాట రాజ్యం (మత్స్య దేశం)"
},

{
  id: 49,
  question: "అజ్ఞాతవాస సమయంలో అర్జునుడి పేరు ఏమిటి?",
  options: [
    "కంకుడు",
    "బల్లవుడు",
    "బృహన్నల",
    "గ్రంథికుడు"
  ],
  answer: "బృహన్నల"
},

{
  id: 50,
  question: "అజ్ఞాతవాస సమయంలో ద్రౌపది పేరు ఏమిటి?",
  options: [
    "మాలిని",
    "సైరంధ్రి",
    "సుభద్ర",
    "ఉత్తర"
  ],
  answer: "సైరంధ్రి"
},
];

export default questions;